# entities/game.py

class Game:

    def __init__(self, hero):

        # --------------------------
        # Игрок
        # --------------------------
        self.hero = hero

        # --------------------------
        # Мир
        # --------------------------
        self.world = None

        # --------------------------
        # Карта
        # --------------------------
        self.current_location = "Стартовый город"

        # --------------------------
        # Время
        # --------------------------
        self.day = 1
        self.hour = 8

        # --------------------------
        # Экономика
        # --------------------------
        self.gold = 100

        # --------------------------
        # Инвентарь
        # --------------------------
        self.inventory = []

        # --------------------------
        # Экипировка
        # --------------------------
        self.equipment = {}

        # --------------------------
        # Квесты
        # --------------------------
        self.active_quests = []

        # --------------------------
        # Побежденные враги
        # --------------------------
        self.defeated_enemies = []

        # --------------------------
        # Настройки
        # --------------------------
        self.settings = {}

        # --------------------------
        # Сохранение
        # --------------------------
        self.save_name = None